MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX550F256H.PIC
      <edc:DCRDef edc:_addr="0x1FC00BFC" edc:access="---n---n----nnnnnnnnnn-----nnnnn" edc:cname="DEVCFG0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x110ffc1f" edc:name="DEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x110ffc1f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:isidehidden="true" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx4" edc:desc="Communicate on PGEC4/PGED4" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="PWP" edc:desc="Program Flash Write Protect" edc:mask="0x3ff" edc:name="PWP" edc:nzwidth="10">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable" edc:when="(field &amp; 0x3ff) == 0x3ff"/>
              <edc:DCRFieldSemantic edc:cname="PWP1K" edc:desc="First 1K" edc:when="(field &amp; 0x3ff) == 0x3fe"/>
              <edc:DCRFieldSemantic edc:cname="PWP2K" edc:desc="First 2K" edc:when="(field &amp; 0x3ff) == 0x3fd"/>
              <edc:DCRFieldSemantic edc:cname="PWP3K" edc:desc="First 3K" edc:when="(field &amp; 0x3ff) == 0x3fc"/>
              <edc:DCRFieldSemantic edc:cname="PWP4K" edc:desc="First 4K" edc:when="(field &amp; 0x3ff) == 0x3fb"/>
              <edc:DCRFieldSemantic edc:cname="PWP5K" edc:desc="First 5K" edc:when="(field &amp; 0x3ff) == 0x3fa"/>
              <edc:DCRFieldSemantic edc:cname="PWP6K" edc:desc="First 6K" edc:when="(field &amp; 0x3ff) == 0x3f9"/>
              <edc:DCRFieldSemantic edc:cname="PWP7K" edc:desc="First 7K" edc:when="(field &amp; 0x3ff) == 0x3f8"/>
              <edc:DCRFieldSemantic edc:cname="PWP8K" edc:desc="First 8K" edc:when="(field &amp; 0x3ff) == 0x3f7"/>
              <edc:DCRFieldSemantic edc:cname="PWP9K" edc:desc="First 9K" edc:when="(field &amp; 0x3ff) == 0x3f6"/>
              <edc:DCRFieldSemantic edc:cname="PWP10K" edc:desc="First 10K" edc:when="(field &amp; 0x3ff) == 0x3f5"/>
              <edc:DCRFieldSemantic edc:cname="PWP11K" edc:desc="First 11K" edc:when="(field &amp; 0x3ff) == 0x3f4"/>
              <edc:DCRFieldSemantic edc:cname="PWP12K" edc:desc="First 12K" edc:when="(field &amp; 0x3ff) == 0x3f3"/>
              <edc:DCRFieldSemantic edc:cname="PWP13K" edc:desc="First 13K" edc:when="(field &amp; 0x3ff) == 0x3f2"/>
              <edc:DCRFieldSemantic edc:cname="PWP14K" edc:desc="First 14K" edc:when="(field &amp; 0x3ff) == 0x3f1"/>
              <edc:DCRFieldSemantic edc:cname="PWP15K" edc:desc="First 15K" edc:when="(field &amp; 0x3ff) == 0x3f0"/>
              <edc:DCRFieldSemantic edc:cname="PWP16K" edc:desc="First 16K" edc:when="(field &amp; 0x3ff) == 0x3ef"/>
              <edc:DCRFieldSemantic edc:cname="PWP17K" edc:desc="First 17K" edc:when="(field &amp; 0x3ff) == 0x3ee"/>
              <edc:DCRFieldSemantic edc:cname="PWP18K" edc:desc="First 18K" edc:when="(field &amp; 0x3ff) == 0x3ed"/>
              <edc:DCRFieldSemantic edc:cname="PWP19K" edc:desc="First 19K" edc:when="(field &amp; 0x3ff) == 0x3ec"/>
              <edc:DCRFieldSemantic edc:cname="PWP20K" edc:desc="First 20K" edc:when="(field &amp; 0x3ff) == 0x3eb"/>
              <edc:DCRFieldSemantic edc:cname="PWP21K" edc:desc="First 21K" edc:when="(field &amp; 0x3ff) == 0x3ea"/>
              <edc:DCRFieldSemantic edc:cname="PWP22K" edc:desc="First 22K" edc:when="(field &amp; 0x3ff) == 0x3e9"/>
              <edc:DCRFieldSemantic edc:cname="PWP23K" edc:desc="First 23K" edc:when="(field &amp; 0x3ff) == 0x3e8"/>
              <edc:DCRFieldSemantic edc:cname="PWP24K" edc:desc="First 24K" edc:when="(field &amp; 0x3ff) == 0x3e7"/>
              <edc:DCRFieldSemantic edc:cname="PWP25K" edc:desc="First 25K" edc:when="(field &amp; 0x3ff) == 0x3e6"/>
              <edc:DCRFieldSemantic edc:cname="PWP26K" edc:desc="First 26K" edc:when="(field &amp; 0x3ff) == 0x3e5"/>
              <edc:DCRFieldSemantic edc:cname="PWP27K" edc:desc="First 27K" edc:when="(field &amp; 0x3ff) == 0x3e4"/>
              <edc:DCRFieldSemantic edc:cname="PWP28K" edc:desc="First 28K" edc:when="(field &amp; 0x3ff) == 0x3e3"/>
              <edc:DCRFieldSemantic edc:cname="PWP29K" edc:desc="First 29K" edc:when="(field &amp; 0x3ff) == 0x3e2"/>
              <edc:DCRFieldSemantic edc:cname="PWP30K" edc:desc="First 30K" edc:when="(field &amp; 0x3ff) == 0x3e1"/>
              <edc:DCRFieldSemantic edc:cname="PWP31K" edc:desc="First 31K" edc:when="(field &amp; 0x3ff) == 0x3e0"/>
              <edc:DCRFieldSemantic edc:cname="PWP32K" edc:desc="First 32K" edc:when="(field &amp; 0x3ff) == 0x3df"/>
              <edc:DCRFieldSemantic edc:cname="PWP33K" edc:desc="First 33K" edc:when="(field &amp; 0x3ff) == 0x3de"/>
              <edc:DCRFieldSemantic edc:cname="PWP34K" edc:desc="First 34K" edc:when="(field &amp; 0x3ff) == 0x3dd"/>
              <edc:DCRFieldSemantic edc:cname="PWP35K" edc:desc="First 35K" edc:when="(field &amp; 0x3ff) == 0x3dc"/>
              <edc:DCRFieldSemantic edc:cname="PWP36K" edc:desc="First 36K" edc:when="(field &amp; 0x3ff) == 0x3db"/>
              <edc:DCRFieldSemantic edc:cname="PWP37K" edc:desc="First 37K" edc:when="(field &amp; 0x3ff) == 0x3da"/>
              <edc:DCRFieldSemantic edc:cname="PWP38K" edc:desc="First 38K" edc:when="(field &amp; 0x3ff) == 0x3d9"/>
              <edc:DCRFieldSemantic edc:cname="PWP39K" edc:desc="First 39K" edc:when="(field &amp; 0x3ff) == 0x3d8"/>
              <edc:DCRFieldSemantic edc:cname="PWP40K" edc:desc="First 40K" edc:when="(field &amp; 0x3ff) == 0x3d7"/>
              <edc:DCRFieldSemantic edc:cname="PWP41K" edc:desc="First 41K" edc:when="(field &amp; 0x3ff) == 0x3d6"/>
              <edc:DCRFieldSemantic edc:cname="PWP42K" edc:desc="First 42K" edc:when="(field &amp; 0x3ff) == 0x3d5"/>
              <edc:DCRFieldSemantic edc:cname="PWP43K" edc:desc="First 43K" edc:when="(field &amp; 0x3ff) == 0x3d4"/>
              <edc:DCRFieldSemantic edc:cname="PWP44K" edc:desc="First 44K" edc:when="(field &amp; 0x3ff) == 0x3d3"/>
              <edc:DCRFieldSemantic edc:cname="PWP45K" edc:desc="First 45K" edc:when="(field &amp; 0x3ff) == 0x3d2"/>
              <edc:DCRFieldSemantic edc:cname="PWP46K" edc:desc="First 46K" edc:when="(field &amp; 0x3ff) == 0x3d1"/>
              <edc:DCRFieldSemantic edc:cname="PWP47K" edc:desc="First 47K" edc:when="(field &amp; 0x3ff) == 0x3d0"/>
              <edc:DCRFieldSemantic edc:cname="PWP48K" edc:desc="First 48K" edc:when="(field &amp; 0x3ff) == 0x3cf"/>
              <edc:DCRFieldSemantic edc:cname="PWP49K" edc:desc="First 49K" edc:when="(field &amp; 0x3ff) == 0x3ce"/>
              <edc:DCRFieldSemantic edc:cname="PWP50K" edc:desc="First 50K" edc:when="(field &amp; 0x3ff) == 0x3cd"/>
              <edc:DCRFieldSemantic edc:cname="PWP51K" edc:desc="First 51K" edc:when="(field &amp; 0x3ff) == 0x3cc"/>
              <edc:DCRFieldSemantic edc:cname="PWP52K" edc:desc="First 52K" edc:when="(field &amp; 0x3ff) == 0x3cb"/>
              <edc:DCRFieldSemantic edc:cname="PWP53K" edc:desc="First 53K" edc:when="(field &amp; 0x3ff) == 0x3ca"/>
              <edc:DCRFieldSemantic edc:cname="PWP54K" edc:desc="First 54K" edc:when="(field &amp; 0x3ff) == 0x3c9"/>
              <edc:DCRFieldSemantic edc:cname="PWP55K" edc:desc="First 55K" edc:when="(field &amp; 0x3ff) == 0x3c8"/>
              <edc:DCRFieldSemantic edc:cname="PWP56K" edc:desc="First 56K" edc:when="(field &amp; 0x3ff) == 0x3c7"/>
              <edc:DCRFieldSemantic edc:cname="PWP57K" edc:desc="First 57K" edc:when="(field &amp; 0x3ff) == 0x3c6"/>
              <edc:DCRFieldSemantic edc:cname="PWP58K" edc:desc="First 58K" edc:when="(field &amp; 0x3ff) == 0x3c5"/>
              <edc:DCRFieldSemantic edc:cname="PWP59K" edc:desc="First 59K" edc:when="(field &amp; 0x3ff) == 0x3c4"/>
              <edc:DCRFieldSemantic edc:cname="PWP60K" edc:desc="First 60K" edc:when="(field &amp; 0x3ff) == 0x3c3"/>
              <edc:DCRFieldSemantic edc:cname="PWP61K" edc:desc="First 61K" edc:when="(field &amp; 0x3ff) == 0x3c2"/>
              <edc:DCRFieldSemantic edc:cname="PWP62K" edc:desc="First 62K" edc:when="(field &amp; 0x3ff) == 0x3c1"/>
              <edc:DCRFieldSemantic edc:cname="PWP63K" edc:desc="First 63K" edc:when="(field &amp; 0x3ff) == 0x3c0"/>
              <edc:DCRFieldSemantic edc:cname="PWP64K" edc:desc="First 64K" edc:when="(field &amp; 0x3ff) == 0x3bf"/>
              <edc:DCRFieldSemantic edc:cname="PWP65K" edc:desc="First 65K" edc:when="(field &amp; 0x3ff) == 0x3be"/>
              <edc:DCRFieldSemantic edc:cname="PWP66K" edc:desc="First 66K" edc:when="(field &amp; 0x3ff) == 0x3bd"/>
              <edc:DCRFieldSemantic edc:cname="PWP67K" edc:desc="First 67K" edc:when="(field &amp; 0x3ff) == 0x3bc"/>
              <edc:DCRFieldSemantic edc:cname="PWP68K" edc:desc="First 68K" edc:when="(field &amp; 0x3ff) == 0x3bb"/>
              <edc:DCRFieldSemantic edc:cname="PWP69K" edc:desc="First 69K" edc:when="(field &amp; 0x3ff) == 0x3ba"/>
              <edc:DCRFieldSemantic edc:cname="PWP70K" edc:desc="First 70K" edc:when="(field &amp; 0x3ff) == 0x3b9"/>
              <edc:DCRFieldSemantic edc:cname="PWP71K" edc:desc="First 71K" edc:when="(field &amp; 0x3ff) == 0x3b8"/>
              <edc:DCRFieldSemantic edc:cname="PWP72K" edc:desc="First 72K" edc:when="(field &amp; 0x3ff) == 0x3b7"/>
              <edc:DCRFieldSemantic edc:cname="PWP73K" edc:desc="First 73K" edc:when="(field &amp; 0x3ff) == 0x3b6"/>
              <edc:DCRFieldSemantic edc:cname="PWP74K" edc:desc="First 74K" edc:when="(field &amp; 0x3ff) == 0x3b5"/>
              <edc:DCRFieldSemantic edc:cname="PWP75K" edc:desc="First 75K" edc:when="(field &amp; 0x3ff) == 0x3b4"/>
              <edc:DCRFieldSemantic edc:cname="PWP76K" edc:desc="First 76K" edc:when="(field &amp; 0x3ff) == 0x3b3"/>
              <edc:DCRFieldSemantic edc:cname="PWP77K" edc:desc="First 77K" edc:when="(field &amp; 0x3ff) == 0x3b2"/>
              <edc:DCRFieldSemantic edc:cname="PWP78K" edc:desc="First 78K" edc:when="(field &amp; 0x3ff) == 0x3b1"/>
              <edc:DCRFieldSemantic edc:cname="PWP79K" edc:desc="First 79K" edc:when="(field &amp; 0x3ff) == 0x3b0"/>
              <edc:DCRFieldSemantic edc:cname="PWP80K" edc:desc="First 80K" edc:when="(field &amp; 0x3ff) == 0x3af"/>
              <edc:DCRFieldSemantic edc:cname="PWP81K" edc:desc="First 81K" edc:when="(field &amp; 0x3ff) == 0x3ae"/>
              <edc:DCRFieldSemantic edc:cname="PWP82K" edc:desc="First 82K" edc:when="(field &amp; 0x3ff) == 0x3ad"/>
              <edc:DCRFieldSemantic edc:cname="PWP83K" edc:desc="First 83K" edc:when="(field &amp; 0x3ff) == 0x3ac"/>
              <edc:DCRFieldSemantic edc:cname="PWP84K" edc:desc="First 84K" edc:when="(field &amp; 0x3ff) == 0x3ab"/>
              <edc:DCRFieldSemantic edc:cname="PWP85K" edc:desc="First 85K" edc:when="(field &amp; 0x3ff) == 0x3aa"/>
              <edc:DCRFieldSemantic edc:cname="PWP86K" edc:desc="First 86K" edc:when="(field &amp; 0x3ff) == 0x3a9"/>
              <edc:DCRFieldSemantic edc:cname="PWP87K" edc:desc="First 87K" edc:when="(field &amp; 0x3ff) == 0x3a8"/>
              <edc:DCRFieldSemantic edc:cname="PWP88K" edc:desc="First 88K" edc:when="(field &amp; 0x3ff) == 0x3a7"/>
              <edc:DCRFieldSemantic edc:cname="PWP89K" edc:desc="First 89K" edc:when="(field &amp; 0x3ff) == 0x3a6"/>
              <edc:DCRFieldSemantic edc:cname="PWP90K" edc:desc="First 90K" edc:when="(field &amp; 0x3ff) == 0x3a5"/>
              <edc:DCRFieldSemantic edc:cname="PWP91K" edc:desc="First 91K" edc:when="(field &amp; 0x3ff) == 0x3a4"/>
              <edc:DCRFieldSemantic edc:cname="PWP92K" edc:desc="First 92K" edc:when="(field &amp; 0x3ff) == 0x3a3"/>
              <edc:DCRFieldSemantic edc:cname="PWP93K" edc:desc="First 93K" edc:when="(field &amp; 0x3ff) == 0x3a2"/>
              <edc:DCRFieldSemantic edc:cname="PWP94K" edc:desc="First 94K" edc:when="(field &amp; 0x3ff) == 0x3a1"/>
              <edc:DCRFieldSemantic edc:cname="PWP95K" edc:desc="First 95K" edc:when="(field &amp; 0x3ff) == 0x3a0"/>
              <edc:DCRFieldSemantic edc:cname="PWP96K" edc:desc="First 96K" edc:when="(field &amp; 0x3ff) == 0x39f"/>
              <edc:DCRFieldSemantic edc:cname="PWP97K" edc:desc="First 97K" edc:when="(field &amp; 0x3ff) == 0x39e"/>
              <edc:DCRFieldSemantic edc:cname="PWP98K" edc:desc="First 98K" edc:when="(field &amp; 0x3ff) == 0x39d"/>
              <edc:DCRFieldSemantic edc:cname="PWP99K" edc:desc="First 99K" edc:when="(field &amp; 0x3ff) == 0x39c"/>
              <edc:DCRFieldSemantic edc:cname="PWP100K" edc:desc="First 100K" edc:when="(field &amp; 0x3ff) == 0x39b"/>
              <edc:DCRFieldSemantic edc:cname="PWP101K" edc:desc="First 101K" edc:when="(field &amp; 0x3ff) == 0x39a"/>
              <edc:DCRFieldSemantic edc:cname="PWP102K" edc:desc="First 102K" edc:when="(field &amp; 0x3ff) == 0x399"/>
              <edc:DCRFieldSemantic edc:cname="PWP103K" edc:desc="First 103K" edc:when="(field &amp; 0x3ff) == 0x398"/>
              <edc:DCRFieldSemantic edc:cname="PWP104K" edc:desc="First 104K" edc:when="(field &amp; 0x3ff) == 0x397"/>
              <edc:DCRFieldSemantic edc:cname="PWP105K" edc:desc="First 105K" edc:when="(field &amp; 0x3ff) == 0x396"/>
              <edc:DCRFieldSemantic edc:cname="PWP106K" edc:desc="First 106K" edc:when="(field &amp; 0x3ff) == 0x395"/>
              <edc:DCRFieldSemantic edc:cname="PWP107K" edc:desc="First 107K" edc:when="(field &amp; 0x3ff) == 0x394"/>
              <edc:DCRFieldSemantic edc:cname="PWP108K" edc:desc="First 108K" edc:when="(field &amp; 0x3ff) == 0x393"/>
              <edc:DCRFieldSemantic edc:cname="PWP109K" edc:desc="First 109K" edc:when="(field &amp; 0x3ff) == 0x392"/>
              <edc:DCRFieldSemantic edc:cname="PWP110K" edc:desc="First 110K" edc:when="(field &amp; 0x3ff) == 0x391"/>
              <edc:DCRFieldSemantic edc:cname="PWP111K" edc:desc="First 111K" edc:when="(field &amp; 0x3ff) == 0x390"/>
              <edc:DCRFieldSemantic edc:cname="PWP112K" edc:desc="First 112K" edc:when="(field &amp; 0x3ff) == 0x38f"/>
              <edc:DCRFieldSemantic edc:cname="PWP113K" edc:desc="First 113K" edc:when="(field &amp; 0x3ff) == 0x38e"/>
              <edc:DCRFieldSemantic edc:cname="PWP114K" edc:desc="First 114K" edc:when="(field &amp; 0x3ff) == 0x38d"/>
              <edc:DCRFieldSemantic edc:cname="PWP115K" edc:desc="First 115K" edc:when="(field &amp; 0x3ff) == 0x38c"/>
              <edc:DCRFieldSemantic edc:cname="PWP116K" edc:desc="First 116K" edc:when="(field &amp; 0x3ff) == 0x38b"/>
              <edc:DCRFieldSemantic edc:cname="PWP117K" edc:desc="First 117K" edc:when="(field &amp; 0x3ff) == 0x38a"/>
              <edc:DCRFieldSemantic edc:cname="PWP118K" edc:desc="First 118K" edc:when="(field &amp; 0x3ff) == 0x389"/>
              <edc:DCRFieldSemantic edc:cname="PWP119K" edc:desc="First 119K" edc:when="(field &amp; 0x3ff) == 0x388"/>
              <edc:DCRFieldSemantic edc:cname="PWP120K" edc:desc="First 120K" edc:when="(field &amp; 0x3ff) == 0x387"/>
              <edc:DCRFieldSemantic edc:cname="PWP121K" edc:desc="First 121K" edc:when="(field &amp; 0x3ff) == 0x386"/>
              <edc:DCRFieldSemantic edc:cname="PWP122K" edc:desc="First 122K" edc:when="(field &amp; 0x3ff) == 0x385"/>
              <edc:DCRFieldSemantic edc:cname="PWP123K" edc:desc="First 123K" edc:when="(field &amp; 0x3ff) == 0x384"/>
              <edc:DCRFieldSemantic edc:cname="PWP124K" edc:desc="First 124K" edc:when="(field &amp; 0x3ff) == 0x383"/>
              <edc:DCRFieldSemantic edc:cname="PWP125K" edc:desc="First 125K" edc:when="(field &amp; 0x3ff) == 0x382"/>
              <edc:DCRFieldSemantic edc:cname="PWP126K" edc:desc="First 126K" edc:when="(field &amp; 0x3ff) == 0x381"/>
              <edc:DCRFieldSemantic edc:cname="PWP127K" edc:desc="First 127K" edc:when="(field &amp; 0x3ff) == 0x380"/>
              <edc:DCRFieldSemantic edc:cname="PWP128K" edc:desc="First 128K" edc:when="(field &amp; 0x3ff) == 0x37f"/>
              <edc:DCRFieldSemantic edc:cname="PWP129K" edc:desc="First 129K" edc:when="(field &amp; 0x3ff) == 0x37e"/>
              <edc:DCRFieldSemantic edc:cname="PWP130K" edc:desc="First 130K" edc:when="(field &amp; 0x3ff) == 0x37d"/>
              <edc:DCRFieldSemantic edc:cname="PWP131K" edc:desc="First 131K" edc:when="(field &amp; 0x3ff) == 0x37c"/>
              <edc:DCRFieldSemantic edc:cname="PWP132K" edc:desc="First 132K" edc:when="(field &amp; 0x3ff) == 0x37b"/>
              <edc:DCRFieldSemantic edc:cname="PWP133K" edc:desc="First 133K" edc:when="(field &amp; 0x3ff) == 0x37a"/>
              <edc:DCRFieldSemantic edc:cname="PWP134K" edc:desc="First 134K" edc:when="(field &amp; 0x3ff) == 0x379"/>
              <edc:DCRFieldSemantic edc:cname="PWP135K" edc:desc="First 135K" edc:when="(field &amp; 0x3ff) == 0x378"/>
              <edc:DCRFieldSemantic edc:cname="PWP136K" edc:desc="First 136K" edc:when="(field &amp; 0x3ff) == 0x377"/>
              <edc:DCRFieldSemantic edc:cname="PWP137K" edc:desc="First 137K" edc:when="(field &amp; 0x3ff) == 0x376"/>
              <edc:DCRFieldSemantic edc:cname="PWP138K" edc:desc="First 138K" edc:when="(field &amp; 0x3ff) == 0x375"/>
              <edc:DCRFieldSemantic edc:cname="PWP139K" edc:desc="First 139K" edc:when="(field &amp; 0x3ff) == 0x374"/>
              <edc:DCRFieldSemantic edc:cname="PWP140K" edc:desc="First 140K" edc:when="(field &amp; 0x3ff) == 0x373"/>
              <edc:DCRFieldSemantic edc:cname="PWP141K" edc:desc="First 141K" edc:when="(field &amp; 0x3ff) == 0x372"/>
              <edc:DCRFieldSemantic edc:cname="PWP142K" edc:desc="First 142K" edc:when="(field &amp; 0x3ff) == 0x371"/>
              <edc:DCRFieldSemantic edc:cname="PWP143K" edc:desc="First 143K" edc:when="(field &amp; 0x3ff) == 0x370"/>
              <edc:DCRFieldSemantic edc:cname="PWP144K" edc:desc="First 144K" edc:when="(field &amp; 0x3ff) == 0x36f"/>
              <edc:DCRFieldSemantic edc:cname="PWP145K" edc:desc="First 145K" edc:when="(field &amp; 0x3ff) == 0x36e"/>
              <edc:DCRFieldSemantic edc:cname="PWP146K" edc:desc="First 146K" edc:when="(field &amp; 0x3ff) == 0x36d"/>
              <edc:DCRFieldSemantic edc:cname="PWP147K" edc:desc="First 147K" edc:when="(field &amp; 0x3ff) == 0x36c"/>
              <edc:DCRFieldSemantic edc:cname="PWP148K" edc:desc="First 148K" edc:when="(field &amp; 0x3ff) == 0x36b"/>
              <edc:DCRFieldSemantic edc:cname="PWP149K" edc:desc="First 149K" edc:when="(field &amp; 0x3ff) == 0x36a"/>
              <edc:DCRFieldSemantic edc:cname="PWP150K" edc:desc="First 150K" edc:when="(field &amp; 0x3ff) == 0x369"/>
              <edc:DCRFieldSemantic edc:cname="PWP151K" edc:desc="First 151K" edc:when="(field &amp; 0x3ff) == 0x368"/>
              <edc:DCRFieldSemantic edc:cname="PWP152K" edc:desc="First 152K" edc:when="(field &amp; 0x3ff) == 0x367"/>
              <edc:DCRFieldSemantic edc:cname="PWP153K" edc:desc="First 153K" edc:when="(field &amp; 0x3ff) == 0x366"/>
              <edc:DCRFieldSemantic edc:cname="PWP154K" edc:desc="First 154K" edc:when="(field &amp; 0x3ff) == 0x365"/>
              <edc:DCRFieldSemantic edc:cname="PWP155K" edc:desc="First 155K" edc:when="(field &amp; 0x3ff) == 0x364"/>
              <edc:DCRFieldSemantic edc:cname="PWP156K" edc:desc="First 156K" edc:when="(field &amp; 0x3ff) == 0x363"/>
              <edc:DCRFieldSemantic edc:cname="PWP157K" edc:desc="First 157K" edc:when="(field &amp; 0x3ff) == 0x362"/>
              <edc:DCRFieldSemantic edc:cname="PWP158K" edc:desc="First 158K" edc:when="(field &amp; 0x3ff) == 0x361"/>
              <edc:DCRFieldSemantic edc:cname="PWP159K" edc:desc="First 159K" edc:when="(field &amp; 0x3ff) == 0x360"/>
              <edc:DCRFieldSemantic edc:cname="PWP160K" edc:desc="First 160K" edc:when="(field &amp; 0x3ff) == 0x35f"/>
              <edc:DCRFieldSemantic edc:cname="PWP161K" edc:desc="First 161K" edc:when="(field &amp; 0x3ff) == 0x35e"/>
              <edc:DCRFieldSemantic edc:cname="PWP162K" edc:desc="First 162K" edc:when="(field &amp; 0x3ff) == 0x35d"/>
              <edc:DCRFieldSemantic edc:cname="PWP163K" edc:desc="First 163K" edc:when="(field &amp; 0x3ff) == 0x35c"/>
              <edc:DCRFieldSemantic edc:cname="PWP164K" edc:desc="First 164K" edc:when="(field &amp; 0x3ff) == 0x35b"/>
              <edc:DCRFieldSemantic edc:cname="PWP165K" edc:desc="First 165K" edc:when="(field &amp; 0x3ff) == 0x35a"/>
              <edc:DCRFieldSemantic edc:cname="PWP166K" edc:desc="First 166K" edc:when="(field &amp; 0x3ff) == 0x359"/>
              <edc:DCRFieldSemantic edc:cname="PWP167K" edc:desc="First 167K" edc:when="(field &amp; 0x3ff) == 0x358"/>
              <edc:DCRFieldSemantic edc:cname="PWP168K" edc:desc="First 168K" edc:when="(field &amp; 0x3ff) == 0x357"/>
              <edc:DCRFieldSemantic edc:cname="PWP169K" edc:desc="First 169K" edc:when="(field &amp; 0x3ff) == 0x356"/>
              <edc:DCRFieldSemantic edc:cname="PWP170K" edc:desc="First 170K" edc:when="(field &amp; 0x3ff) == 0x355"/>
              <edc:DCRFieldSemantic edc:cname="PWP171K" edc:desc="First 171K" edc:when="(field &amp; 0x3ff) == 0x354"/>
              <edc:DCRFieldSemantic edc:cname="PWP172K" edc:desc="First 172K" edc:when="(field &amp; 0x3ff) == 0x353"/>
              <edc:DCRFieldSemantic edc:cname="PWP173K" edc:desc="First 173K" edc:when="(field &amp; 0x3ff) == 0x352"/>
              <edc:DCRFieldSemantic edc:cname="PWP174K" edc:desc="First 174K" edc:when="(field &amp; 0x3ff) == 0x351"/>
              <edc:DCRFieldSemantic edc:cname="PWP175K" edc:desc="First 175K" edc:when="(field &amp; 0x3ff) == 0x350"/>
              <edc:DCRFieldSemantic edc:cname="PWP176K" edc:desc="First 176K" edc:when="(field &amp; 0x3ff) == 0x34f"/>
              <edc:DCRFieldSemantic edc:cname="PWP177K" edc:desc="First 177K" edc:when="(field &amp; 0x3ff) == 0x34e"/>
              <edc:DCRFieldSemantic edc:cname="PWP178K" edc:desc="First 178K" edc:when="(field &amp; 0x3ff) == 0x34d"/>
              <edc:DCRFieldSemantic edc:cname="PWP179K" edc:desc="First 179K" edc:when="(field &amp; 0x3ff) == 0x34c"/>
              <edc:DCRFieldSemantic edc:cname="PWP180K" edc:desc="First 180K" edc:when="(field &amp; 0x3ff) == 0x34b"/>
              <edc:DCRFieldSemantic edc:cname="PWP181K" edc:desc="First 181K" edc:when="(field &amp; 0x3ff) == 0x34a"/>
              <edc:DCRFieldSemantic edc:cname="PWP182K" edc:desc="First 182K" edc:when="(field &amp; 0x3ff) == 0x349"/>
